### 1.Using the emp.csv file available in common folder,create a data frame object named ef1.

In [3]:
import pandas as pd

dfe = pd.read_csv('emp.csv')
dfe

             ename  eno     edesig  esalary           ephno
0            K.Raj  101  scientist  50000.0  (0493)-2287278
1     Mohan Raj M.  102   engineer  50000.0  [0496]-2287278
2            M.Ram  104  scientist  80000.0  (0491)-4287275
3        Ram Kumar  104  scientist  60000.0  (0491)-4287335
4  Mohan Babu K.K.  106    officer  50000.0  {0496}-2387278
5          K.Gopal  107  scientist  50000.0  (0493)-2287278
6      Anil Raj M.  108   engineer  50000.0  {0496]-2287278
7         Amala P.  201  scientist  70000.0  (0498)-9287275
8             Uma   204    officer  60000.0  (0491)-4287335
9             Suma  206   engineer  50000.0    0496_2387278

### 2.Remove all the non digit characters from ephno column and store the new data in ef2.

In [55]:
### using apply
import re

def fn_rm_nd(n):
    return re.sub('[^0-9]','',str(n))

dfe['ephno'] = dfe['ephno'].apply(fn_rm_nd)
print dfe

dfe.to_excel('emp.xlsx',index=False)

             ename  eno     edesig  esalary        ephno
0            K.Raj  101  scientist  50000.0  04932287278
1     Mohan Raj M.  102   engineer  50000.0  04962287278
2            M.Ram  104  scientist  80000.0  04914287275
3        Ram Kumar  104  scientist  60000.0  04914287335
4  Mohan Babu K.K.  106    officer  50000.0  04962387278
5          K.Gopal  107  scientist  50000.0  04932287278
6      Anil Raj M.  108   engineer  50000.0  04962287278
7         Amala P.  201  scientist  70000.0  04989287275
8             Uma   204    officer  60000.0  04914287335
9             Suma  206   engineer  50000.0  04962387278

### 3.Write the three columns ename,edesig and esalary to the excel file empx.xlsx with sheet name as salary

In [25]:
dfe.to_excel('out.xlsx',columns=['ename','edesig','esalary'],index=False)

### 4.Write the two columns ename and  ephno to the same excel file empx.xlsx with sheet name as phone

In [27]:
dfe.to_excel('out2.xlsx',columns=['ename','ephno'],index=False,sheet_name='phone')

### 5.In the data frame  make edesig and eno as row index & store the new data frame

In [30]:
print dfe.head()

             ename  eno     edesig  esalary        ephno
0            K.Raj  101  scientist  50000.0  04932287278
1     Mohan Raj M.  102   engineer  50000.0  04962287278
2            M.Ram  104  scientist  80000.0  04914287275
3        Ram Kumar  104  scientist  60000.0  04914287335
4  Mohan Babu K.K.  106    officer  50000.0  04962387278

In [34]:
dfnew = dfe.set_index(['edesig','eno'])
dfnew

                         ename  esalary        ephno
edesig    eno
scientist 101            K.Raj  50000.0  04932287278
engineer  102     Mohan Raj M.  50000.0  04962287278
scientist 104            M.Ram  80000.0  04914287275
          104        Ram Kumar  60000.0  04914287335
officer   106  Mohan Babu K.K.  50000.0  04962387278
scientist 107          K.Gopal  50000.0  04932287278
engineer  108      Anil Raj M.  50000.0  04962287278
scientist 201         Amala P.  70000.0  04989287275
officer   204             Uma   60000.0  04914287335
engineer  206             Suma  50000.0  04962387278

### 6.In result sort the index edesig

In [46]:
dfisort = dfnew.sort_index(level='edesig')
dfisort

                         ename  esalary        ephno
edesig    eno
engineer  102     Mohan Raj M.  50000.0  04962287278
          108      Anil Raj M.  50000.0  04962287278
          206             Suma  50000.0  04962387278
officer   106  Mohan Babu K.K.  50000.0  04962387278
          204             Uma   60000.0  04914287335
scientist 101            K.Raj  50000.0  04932287278
          104            M.Ram  80000.0  04914287275
          104        Ram Kumar  60000.0  04914287335
          107          K.Gopal  50000.0  04932287278
          201         Amala P.  70000.0  04989287275

###  6.1.Using  display all the scientists records.
### 6.2.Display average salary of engineers.
### 6.3.Display the lowest salary for scientist designation.

In [48]:
dfisort.loc['scientist']

         ename  esalary        ephno
eno
101      K.Raj  50000.0  04932287278
104      M.Ram  80000.0  04914287275
104  Ram Kumar  60000.0  04914287335
107    K.Gopal  50000.0  04932287278
201   Amala P.  70000.0  04989287275

In [51]:
dfisort.loc['engineer']['esalary'].mean()

50000.0

In [52]:
dfisort.loc['scientist']['esalary'].min()

50000.0